## Question2: 
### Suppose that we have two tables: 
> ### The first table contains employees and their salaries.
> ### The second table contains the company departments and the employees of each department.
### Now, we want to know which departments have the highest salaries in the company.

> ### by: Mohamed AbdelGawad Ibrahim
> #### 01069052620 â€“ 01147821232
> #### muhammad.abdelgawwad@gmail.com

#### In this notebook, I create the two tables in Postgres and load sample data; to provide a practical answer for the previous question

I will use the ipython-sql extension to run the queries inside this jupyter notebook

In [1]:
# Load ipython-sql extension
%load_ext sql

Connect to local postgres database

In [2]:
# Set connection string variables
DB_ENDPOINT = "127.0.0.1"
DB = 'postgres'
DB_USER = 'postgres'
DB_PASSWORD = '123456'
DB_PORT = '5432'

# Build the connection string: postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

# Print the connection string
print(conn_string)

postgresql://postgres:123456@127.0.0.1:5432/postgres

In [3]:
# connect to the database using the connection string
%sql $conn_string

#### Drop the tables if they exist; to have clean tables every time I run this notebook

In [4]:
%%sql
DROP TABLE IF EXISTS employees, departments

 * postgresql://postgres:***@127.0.0.1:5432/postgres
Done.

[]

#### Create the new tables: `employees` and `departments`

In [5]:
%%sql
CREATE TABLE IF NOT EXISTS employees(
    employee_id INT PRIMARY KEY,
    salary INT
)

 * postgresql://postgres:***@127.0.0.1:5432/postgres
Done.

[]

In [6]:
%%sql
CREATE TABLE IF NOT EXISTS departments(
    department_id INT,
    department VARCHAR,
    employee_id INT
)

 * postgresql://postgres:***@127.0.0.1:5432/postgres
Done.

[]

#### Insert sample data

In [7]:
# The insert query
insert_query = """
INSERT INTO employees(
    employee_id, salary
) VALUES
"""

In [8]:
%sql $insert_query (1, 7000)
%sql $insert_query (2, 8000)
%sql $insert_query (3, 7500)
%sql $insert_query (4, 8200)
%sql $insert_query (5, 8700)
%sql $insert_query (6, 9000)
%sql $insert_query (7, 9500)
%sql $insert_query (8, 10000)
%sql $insert_query (9, 15000)
%sql $insert_query (10, 11000)

 * postgresql://postgres:***@127.0.0.1:5432/postgres
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/postgres
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/postgres
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/postgres
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/postgres
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/postgres
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/postgres
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/postgres
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/postgres
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/postgres
1 rows affected.

[]

In [9]:
# The insert query
insert_query = """
INSERT INTO departments(
    department_id, department, employee_id
) VALUES
"""

In [10]:
%sql $insert_query (1, 'Marketing', 1)
%sql $insert_query (2, 'Sales', 2)
%sql $insert_query (3, 'Production', 3)
%sql $insert_query (1, 'Marketing', 4)
%sql $insert_query (2, 'Sales', 5)
%sql $insert_query (3, 'Production', 6)
%sql $insert_query (1, 'Marketing', 7)
%sql $insert_query (2, 'Sales', 8)
%sql $insert_query (3, 'Production', 9)
%sql $insert_query (1, 'Marketing', 10)

 * postgresql://postgres:***@127.0.0.1:5432/postgres
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/postgres
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/postgres
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/postgres
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/postgres
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/postgres
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/postgres
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/postgres
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/postgres
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/postgres
1 rows affected.

[]

#### Confirm that data were inserted successfully

In [11]:
%%sql
SELECT
    employee_id,
    salary
FROM employees

 * postgresql://postgres:***@127.0.0.1:5432/postgres
10 rows affected.

[(1, 7000),
 (2, 8000),
 (3, 7500),
 (4, 8200),
 (5, 8700),
 (6, 9000),
 (7, 9500),
 (8, 10000),
 (9, 15000),
 (10, 11000)]

In [12]:
%%sql
SELECT
    department_id,
    department,
    employee_id
FROM departments

 * postgresql://postgres:***@127.0.0.1:5432/postgres
10 rows affected.

[(1, 'Marketing', 1),
 (2, 'Sales', 2),
 (3, 'Production', 3),
 (1, 'Marketing', 4),
 (2, 'Sales', 5),
 (3, 'Production', 6),
 (1, 'Marketing', 7),
 (2, 'Sales', 8),
 (3, 'Production', 9),
 (1, 'Marketing', 10)]

### Find Which Depatments Have The Highest Salaries

In [13]:
%%sql
SELECT d.department, MAX(e.salary) AS max_salary
FROM employees e
    JOIN departments d ON e.employee_id = d.employee_id
GROUP BY d.department
ORDER BY max_salary DESC

 * postgresql://postgres:***@127.0.0.1:5432/postgres
3 rows affected.

[('Production', 15000), ('Marketing', 11000), ('Sales', 10000)]

### Demonstrate using `WHERE` and `HAVING` Clauses
Repeat same previous task but include only employees with salaries below 10K, and display only the departments of maximum salaries Above or equal to 9K

In [14]:
%%sql
SELECT d.department, MAX(e.salary) AS max_salary
FROM employees e
    JOIN departments d ON e.employee_id = d.employee_id
WHERE e.salary < 10000
GROUP BY d.department
HAVING MAX(e.salary) >= 9000
ORDER BY max_salary DESC

 * postgresql://postgres:***@127.0.0.1:5432/postgres
2 rows affected.

[('Marketing', 9500), ('Production', 9000)]